---
layout: post
title: iJUG NL + Android Vortrag
date: 2011-10-27 10:32:40.000000000 +02:00
categories: article
tags:
- iJUG
- android
- DOAG
- W-JAX
status: publish
type: post
published: true
meta: {}
author:
  login: Uwe S.
  email: uwe.sbr@jug-ostfalen.de
  display_name: Uwe S.
  first_name: Uwe
  last_name: Sauerbrei
---
<p>Heute Abend findet unsere Veranstaltung zum Thema Android statt und wie es aussieht, k&ouml;nnen wir mit reger Beteiligung rechnen.&nbsp; Ich freue mich darauf! Nicht vergessen, wir verlosen eine Karte f&uuml;r die Hauptkonferenz der diesj&auml;hrigen W-JAX in einem Monat in M&uuml;nchen. Der Wert betr&auml;gt ~1500&euro; und ich k&ouml;nnte mir vorstellen, dass der eine oder andere nicht abgeneigt w&auml;re.</p>
<p>Dann noch der Hinweis auf den aktuellen <a href="http://www.ijug.eu/newsletter/2011-11-ijug-der-Newsletter.html" target="_blank">Newsletter </a>des iJUG, der sich mit der anstehenden DOAG-Konferenz (James Gosling ist Keynote-Speaker) und Themen zur JavaOne und Java SE besch&auml;ftigt.</p>
<p>Im Dezember findet die n&auml;chste Java EE Summit statt. Wer Interesse hat und &uuml;ber unsere Gruppe bucht, erh&auml;lt 15% Rabatt.&nbsp; Hier noch der offizielle Infotext:</p>
<p>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</p>
<p><!--[if gte mso 9]><xml>    Normal   0       21       false   false   false     DE   X-NONE   X-NONE                         MicrosoftInternetExplorer4                             </xml><![endif]--><!--[if gte mso 9]><xml>                                                                                                                                                                                                                                                                                       </xml><![endif]--><!--[if gte mso 10]><br />
<style> /* Style Definitions */ table.MsoNormalTable	{mso-style-name:"Normale Tabelle";	mso-tstyle-rowband-size:0;	mso-tstyle-colband-size:0;	mso-style-noshow:yes;	mso-style-priority:99;	mso-style-parent:"";	mso-padding-alt:0cm 5.4pt 0cm 5.4pt;	mso-para-margin:0cm;	mso-para-margin-bottom:.0001pt;	mso-pagination:widow-orphan;	font-size:10.0pt;	font-family:"Times New Roman","serif";}</style>
<p><![endif]--></p>
<p class="MsoPlainText"><strong>Java EE Summit &ndash; 15 Workshops mit allen wichtigen Java-EE-Themen</strong></p>
<p><strong><span style="color: black;">&nbsp;</span></strong><span style="font-size: 12pt; font-family: &quot;Times New Roman&quot;,&quot;serif&quot;;">Vom 07. - 09. Dezember 2011 pr&auml;sentieren das Java Magazin und die Entwickler Akademie den n&auml;chsten Java EE Summit im NH Hotel Berlin Friedrichstra&szlig;e. Das gro&szlig;e Trainingsevent vermittelt alle wichtigen Java EE-Themen innerhalb von drei Tage in kompakter Form. 15 Workshops und zwei Speaker Panel stehen dabei zur Auswahl. Die sechs bekannten Java-EE-Experten &nbsp;- Adam Bien, Lars R&ouml;wekamp, Jens Schumann, Arne Limburg, Thilo Frotscher und Mark Struberg - beziehen sich dabei immer auf die t&auml;gliche Projektarbeit und zeigen den produktiven Live- Einsatz aller Tools und Methoden. Das Konzept des Java EE Summit bietet eine gro&szlig;e Flexibilit&auml;t: Zum einen k&ouml;nnen Themenschwerpunkte individuell festgelegt werden, zum anderen wird ein intensiver Trainingseffekt ohne jeglichen Marketingfilter sicher gestellt. Alle Workshop-Tage sind auch einzeln buchbar. Alle Infos auf <a href="http://www.java-ee-summit.de/">www.java-ee-summit.de</a></span></p>
