---
layout: post
title: DOAG und ein paar Termine..
date: 2012-11-20 21:10:48.000000000 +01:00
categories:
- Newsletter
tags:
- architektur
- code retreat
- javascript
status: publish
type: post
published: true
meta: {}
author:
  login: admin
  email: info@jug-ostfalen.de
  display_name: admin
  first_name: ''
  last_name: ''
---
<p>Schon ist die W-JAX eine gute Woche vor&uuml;ber, da hat mit der DOAG-Konferenz das n&auml;chste gro&szlig;e Java-Event in N&uuml;rnberg seine Pforten ge&ouml;ffnet. Die Atmosph&auml;re ist eine v&ouml;llig andere als in M&uuml;nchen, aber die Qual der Wahl bez&uuml;glich des Vortragsprogramms ist die gleiche. &nbsp;Vielleicht sieht man sich?</p>
<p>In den letzten Tagen habe ich ein paar neue Termine eingestellt und kann feststellen, dass die erste Jahresh&auml;lfte 2013 recht gut verplant ist. &nbsp;F&uuml;r weitere Themen oder Referenten bin ich nat&uuml;rlich weiterhin schnell zu begeistern, will aber hier noch mal schnell auf das aktuelle Programm der kommenden Monate hinweisen:</p>
<ul>
<li>[<strong>29.11.2012</strong>] Unser letzter Stammtisch in diesem Jahr. Nat&uuml;rlich wieder im Dialog in Braunschweig, Zeit wie gehabt. Anmeldung &uuml;ber XING oder an mich pers&ouml;nlich, damit ich den passenden Tisch reservieren kann.&nbsp;</li>
<li>[<strong>08.12.2012</strong>] <em><a href="http://codereatreat.eventbrite.de/" target="_blank">Legacy Code Retreat</a></em> mit Jens Schauder und Ren&eacute; Pfeuffer. Da es nur eine begrenzte Anzahl von Pl&auml;tzen gibt lohnt es sich, sich schnell eine Karte zu sichern!&nbsp;</li>
<li>[<strong>13.12.2012</strong>] <em><a href="http://schachengine.eventbrite.de/" target="_blank">Softwarearchitektur en passant</a></em> mit Stefan Z&ouml;rner (Oose). Wir treffen uns bei CKC und ich gehe davon aus, dass es auch wieder ein paar H&auml;ppchen gibt! :-)</li>
<li>[<strong>17.01.2013</strong>] <em><a href="http://javase8.eventbrite.de/" target="_blank">Java SE &amp; Beyond</a></em> &nbsp;Dalibor Topic (Oracle) hat den Vortrag k&uuml;rzlich in Hamburg gehalten und ich freue mich auf seine Stippvisite bei uns.</li>
<li>[<strong>28.02.2013</strong>] <em><a href="http://javascript-enterprise.eventbrite.de/" target="_blank">JavaScript f&uuml;r Enterprise Entwickler</a></em> - Oliver Ochs (Holisticon) hat gerade sein aktuelles Buch zu diesem Thema ver&ouml;ffentlicht und bringt vielleicht das eine oder andere Exemplar mit...</li>
</ul>
<p>Ansonsten ist die JUG Hannover nun schon recht aktiv und flei&szlig;ig mit der Planung weiterer Aktivit&auml;ten besch&auml;ftigt. Hier lohnt es sich auf jeden Fall, die XING-Gruppe im Auge zu behalten, &uuml;ber die die Koordination haupts&auml;chlich l&auml;uft. &nbsp;</p>
<p>Das n&auml;chste Jahre wird noch mal richtig spannend werden, aber lasst euch einfach mal &uuml;berraschen...</p>
