---
layout: post
title: Umfrage + Angebote
date: 2012-12-12 09:26:49.000000000 +01:00
categories:
- Newsletter
tags:
- architektur
- javafx
status: publish
type: post
published: true
meta: {}
author:
  login: admin
  email: info@jug-ostfalen.de
  display_name: admin
  first_name: ''
  last_name: ''
---
<p><span style="text-decoration: underline;">Zuerst mal eine Anfrage von Oracle an die Community</span>:</p>
<p>&nbsp;</p>
<p class="MsoNormal">Das Oracle Java Product Management eine aktuelle Umfrage zur Verf&uuml;gbarkeit der Java UI Technologie JavaFX f&uuml;r Tablets und mobile Endger&auml;te gestartet.</p>
<p class="MsoNormal">Immer mehr Firmen und Entwickler fragen nach Java Unterst&uuml;tzung von mobilen Endger&auml;ten, insbesondere von JavaFX f&uuml;r Android und iOS.</p>
<p class="MsoNormal">Wenn wir als Java Community die Unterst&uuml;tzung von JavaFX f&uuml;r Tablets &amp; Mobilger&auml;te als wichtig betrachten, dann sollten wir dies auch bekr&auml;ftigen und mit der Teilnahme an der &nbsp;Umfrage ausdr&uuml;cken.</p>
<p>&nbsp;</p>
<p><span style="font-size: 11.0pt; font-family: &quot;Calibri&quot;,&quot;sans-serif&quot;; mso-fareast-font-family: Calibri; mso-fareast-theme-font: minor-latin; mso-ansi-language: DE; mso-fareast-language: DE; mso-bidi-language: AR-SA;">Mit der Bitte um Teilnahme an der <a href="http://fxexperience.com/2012/12/javafx-for-tablets-mobile/" target="_blank">Umfrage</a>!</span></p>
<p>Ich habe wieder zwei interessante Angebote, Fachb&uuml;cher betreffend:</p>
<ul>
<li><strong>O'Reilly</strong> bietet f&uuml;r den heutigen Tag seine Pocket-Referenzen als E-Book f&uuml;r nur 4,99$ an [<a href="http://shop.oreilly.com/category/deals/pocket-references.do?code=PCKTREF&amp;imm_mid=09d369&amp;cmp=em-npa-books-videos-pocket-reference-elist" target="_blank">Link</a>]. Der Verlag bietet &uuml;brigens f&uuml;r Download und Aktualisierung eine Dropbox-Anbindung an. Sehr komfortabel!</li>
<li>Wer sich f&uuml;r Grails interessiert kann heute bei <strong><a href="http://www.manning.com/" target="_blank">Manning </a></strong>ein Schn&auml;ppchen machen und 'Grails in Action' als E-Book f&uuml;r nur 20$ erstehen (Actioncode: <strong>dotd1212cc</strong>) Mit dem gleichen Code kann man auch f&uuml;r 'Griffon in Action' und 'Making Java Groovy' (E-Books) 50% Erm&auml;&szlig;igung bekommen.&nbsp;</li>
</ul>
<p>Nicht vergessen, unsere Veranstaltung morgen bei CKC! Wie es aussieht, kann ich eine ganze Menge Zeitschriften mitbringen, so dass f&uuml;r Lesestoff &uuml;ber die Feiertage gesorgt ist! :-)</p>
