---
layout: post
title: Dies und das...
date: 2012-02-23 23:07:00.000000000 +01:00
categories:
- Kolumne
tags:
- iJUG
- java
status: publish
type: post
published: true
meta: {}
author:
  login: Uwe S.
  email: uwe.sbr@jug-ostfalen.de
  display_name: Uwe S.
  first_name: Uwe
  last_name: Sauerbrei
---
<p>Mir ist gerade aufgefallen, dass sich die letzten Beitr&auml;ge nur auf unsere Veranstaltungen beziehen. &nbsp;Da will ich zumindest noch die eine oder andere Information loswerden, &nbsp;um diesen Zyklus ein wenig aufzubrechen. Ich w&uuml;rde mich nat&uuml;rlich auch freuen, wenn hier Beitr&auml;ge von euch stehen w&uuml;rden und ich bin gerne bereit, weitere Rechte zu vergeben. :-)</p>
<p>Zuerst einmal ist mir der letzte Newsletter des iJUG durch die Lappen gegangen. Mit etwas Versp&auml;tung nun hier der <a href="http://www.ijug.eu/newsletter/2012-02-ijug-der-Newsletter.html" target="_blank">Link</a>. Themen sind u.a. ein Talk mit Ed Burns &uuml;ber JSF, NetBeans, ein neuer Java Podcast und der aktuelle Veranstaltungsplan. Apropos: &nbsp;der Vortrag zum Thema Grails steht vor der T&uuml;r. Es ist wirklcih beeindruckend zu sehen, wie schnell hier eine Webanwendung 'konfiguriert' werden kann. Da wir uns im April auf Groovy konzentrieren, passt das alles hervorragend zusammen. Die Anmeldung nat&uuml;rlich wieder &uuml;ber XING oder <a href="http://grails.eventbrite.com/" target="_blank">EventBrite</a>.</p>
<p>Weiterhin suchen wir immer Autoren f&uuml;r Artikel in unserer Zeitschrift '<strong>Java aktuell</strong>'. &nbsp;Auch hier einfach eine Mail an mich oder direkt an die Redaktion. Es gibt eine Menge Erfahrungen 'da drau&szlig;en', die ihr Publikum sucht! Redaktionsschluss der kommenden Ausgabe ist der 4. April, also noch etwas Zeit f&uuml;r einen (oder mehrere) Artikel.</p>
<p>Heute fand ich noch einen interessanten Link zum <a href="http://openbook.galileocomputing.de/java7/" target="_blank">Download </a>der letzten Version von '<strong>Java 7 - mehr als eine Insel</strong>' von Christian Ullenboom, der &uuml;brigens auch ein Mitglied unserer Xing-Gruppe ist ('Hallo Christian!' :-)</p>
<p>So, was bleibt noch zu sagen? Unsere Bem&uuml;hungen, auch in Hannover eine Veranstaltung durchzuf&uuml;hren, haben erst einmal einen D&auml;mpfer bekommen. Wie es aussieht, ist es in der Landeshauptstadt ein Problem, einen passenden Raum entweder umsonst oder ohne gr&ouml;&szlig;eren B&uuml;rokratismus zu bekommen. &nbsp;Finde ich schade und vielleicht hat ja noch jemand eine Idee, wie wir das &auml;ndern k&ouml;nnten.&nbsp;</p>
