---
layout: post
title: Spring MVC + W-Jax
date: 2013-08-11 23:20:48.000000000 +02:00
categories: article
tags:
- Veranstaltungen
- MVC
- spring
- W-JAX
status: publish
type: post
published: true
meta: {}
author: uwe
---
<p>Kurz bevor die neue Woche beginnt m&ouml;chte ich noch ein paar Gedanken loswerden. &nbsp; In der kommenden Woche haben wir &nbsp;unseren ersten Vortrag nach der &nbsp;Sommerpause. Oliver Gierke kommt zu uns nach Wolfsburg und da er bereits einige Vortr&auml;ge gehalten hat, birgt sein Name schon f&uuml;r Qualit&auml;t und gro&szlig;en Unterhaltungswert. Ich freue &nbsp;mich auf jeden Fall &nbsp;und hoffe mal, dass wir den Vortragsraum bei der T-Systems wieder gut f&uuml;llen k&ouml;nnen. &nbsp; Hier noch mal die Details und die Anmeldung:</p>
<p><strong>https://springmvc.eventbrite.de/</strong></p>
<p>Die <a href="http://jax.de/" target="_blank">W-Jax</a> steht nun auch bald wieder vor der T&uuml;r und ich freue mich, auch in diesem Jahr einen Rabatt f&uuml;r die Mitglieder unserer JUG anbieten zu k&ouml;nnen. &nbsp;Bei Interesse einfach bei mir melden und hier noch ein paar Infos aus der Pressemeldung:</p>
<p><span style="color: #000080;"><em>W-JAX 2013: Mehr als 160 internationale IT-Experten referieren in M&uuml;nchen&nbsp;</em></span></p>
<p><span style="color: #000080;"><em>&bull; &nbsp; &nbsp;5 Tage mit &uuml;ber 180 Vortr&auml;gen, ganzt&auml;gigen Workshops und Thementagen&nbsp;</em></span></p>
<p><span style="color: #000080;"><em>&bull; &nbsp; &nbsp;Umfangreiches Konferenzprogramm aus Java- und Enterprise-Technologien&nbsp;</em></span></p>
<p><span style="color: #000080;"><em>M&uuml;nchen, 25. Juli 2013 &ndash; Die W-JAX l&auml;dt einmal mehr mit einem umfangreichen Programm rund um Java, Architektur, Agile, Cloud und vielem mehr nach M&uuml;nchen. Vom 4. bis 8. November pr&auml;sentiert die Herbstausgabe der JAX mehr als 160 renommierte Referenten aus dem IT-Bereich mit &uuml;ber 180 Vortr&auml;gen. Die Teilnehmer erwarten themenspezifische Vortragsreihen &ndash; die so genannten Special Days &ndash; informative Einzelvortr&auml;ge sowie ganzt&auml;gige Workshops.&nbsp;</em></span></p>
<p><span style="color: #000080;"><em>Mit dem Workshop-Montag startet die W-JAX am 4. November in die f&uuml;nft&auml;gige Konferenzwoche. In den ganzt&auml;gigen und praxisorientierten Workshops zu Themen wie Java EE 7, JFS, GIT und Hadoop arbeiten die Teilnehmer gemeinsam mit erfahrenen Trainern hands-on anhand themenrelevanter Beispiele. Auf individuelle Fragen der Teilnehmer gehen die praxiserprobten Referenten ein und geben gezielt Hilfestellungen und Ratschl&auml;ge. Die Workshops rund um Continuous Delivery, Eclipse 4.x Application Platform und Spring beschlie&szlig;en die Konferenzwoche am Freitag (8. November). Die W-JAX bietet den Teilnehmern w&auml;hrend der Konferenzwoche insgesamt mehr als 18 sogenannte Special Days. Im Rahmen der themenspezifischen Vortragsreihen erhalten die Teilnehmer die M&ouml;glichkeit, ihr Wissen in ausgew&auml;hlten Kernbereichen zu vertiefen. Der Agile Day und der JavaFX 101 Day geben am Montag (4. November) den Auftakt zu den Thementagen. Der Agile Day zeigt unter anderem auf, wie sich agile Vorgehensweisen gewinnbringend in Softwareentwicklungsprojekten umsetzen lassen. Im Rahmen des JavaFX 101 Days erhalten die Teilnehmer einen allumfassenden Blick auf die UI-Technologie.&nbsp;</em></span></p>
