---
layout: post
title: Herr Java und Frau Elster...
date: 2013-03-08 08:01:27.000000000 +01:00
categories:
- Allgemein
tags:
- elster
- java
- jquery
status: publish
type: post
published: true
meta: {}
author:
  login: admin
  email: info@jug-ostfalen.de
  display_name: admin
  first_name: ''
  last_name: ''
---
<p>Da trennen sich wohl mittelfristig die Wege von einem der gr&ouml;&szlig;ten Java-Vorzeigeprogramme und der deutschen Steuerverwaltung. &nbsp;Verwunderlich ist der Unmut ja nun nicht, nachdem es in letzter Zeit die haarstr&auml;ubendsten Meldungen zur Verwundbarkeit von Java und der drohenden Apokalypse im Enterprise-Bereich gegeben hatte. Ich will damit nicht behaupten, dass die JDK's (das gerade aktuelle ebenso wie die Vorg&auml;ngerversion) keine Sicherheitsprobleme h&auml;tten. Jedoch w&auml;re ein wenig mehr fundierte Berichterstattung, gerade wenn es sicherheitsrelevante Institutionen betrifft, angemessener gewesen. &nbsp;Nicht jeder kann die Sofortma&szlig;nahmen, die von &nbsp;Browser wegwerfen, &nbsp;Java deinstallieren bis Rechner verschrotten :-) reichten, entsprechend einordnen und nun haben wir den Salat. &nbsp;Wird keine L&ouml;sung gefunden steht letztendlich zu bef&uuml;rchten, dass die Finanz&auml;mter auf unbestimmte Zeit keine Einkommensteuererkl&auml;rungen mehr bekommen werden, die Finanzlage der Republik sich dramatisch zuspitzen wird, Deutschland als Zugpferd in Europa seine Position verliert und alle &uuml;brigen L&auml;nder mit sich in den Abgrund rei&szlig;t. Vermutlich werden wir dann von den Chinesen gekauft, was eine Menge Geld in die Kassen sp&uuml;len wird und zumindest dazu f&uuml;hrt, dass S21, die Elbphilharmonie und der Flughafen Berlin-Brandenburg fertiggestellt werden, denn eines haben die Chinesen bewiesen: Sie k&ouml;nnen gro&szlig;e Bauwerke meistern! :-)</p>
<p>...und alles nur wegen Java!</p>
<p>Ach ja, wer hier noch eine andere Bewertung zur Situation lesen m&ouml;chte, m&ouml;ge folgenden <a href="http://www.heise.de/open/meldung/Elster-Finanzverwaltung-rueckt-von-Java-ab-1818631.html" target="_blank">Artikel </a>lesen!&nbsp;</p>
